app/Controllers/Category.php

    function editBrand($id)
    {
        $this->data['content'] = $this->brand->find($id);
        $this->data['category'] = $this->model->findAll();
---
SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
 LIMIT 10